* TODO Shanbei English words learning :learning:
SCHEDULED: <2021-08-12 Thu 14:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2021-08-11 Wed 14:25]
:END:
- State "DONE"       from "STRT"       [2021-08-11 Wed 14:25]
- State "DONE"       from "TODO"       [2021-08-11 Wed 10:01]
- State "DONE"       from "DOING"      [2021-08-09 Mon 14:27]
- State "DONE"       from "DOING"      [2021-08-08 Sun 23:53]
- State "DONE"       from "TODO"       [2021-08-08 Sun 23:37]
- State "DONE"       from "DOING"      [2021-08-06 Fri 14:41]
- State "DONE"       from "TODO"       [2021-08-05 Thu 16:51]
- State "DONE"       from "DOING"      [2021-08-04 Wed 14:13]
- State "DONE"       from "TODO"       [2021-08-03 Tue 22:44]
:LOGBOOK:
CLOCK: [2021-08-11 Wed 14:17]--[2021-08-11 Wed 14:25] =>  0:08
CLOCK: [2021-08-09 Mon 14:16]--[2021-08-09 Mon 14:27] =>  0:11
CLOCK: [2021-08-06 Fri 14:32]--[2021-08-06 Fri 14:41] =>  0:09
CLOCK: [2021-08-04 Wed 14:02]--[2021-08-04 Wed 14:13] =>  0:11
CLOCK: [2021-08-03 Tue 09:58]--[2021-08-03 Tue 09:58] =>  0:00
:END:
[2021-08-03 Tue 09:58]
* TODO Finish 1 Leetcode problem :learning:
SCHEDULED: <2021-08-12 Thu 10:30 +1d>
:PROPERTIES:
:LAST_REPEAT: [2021-08-11 Wed 10:46]
:END:
- State "DONE"       from "STRT"       [2021-08-11 Wed 10:46]
- State "DONE"       from "TODO"       [2021-08-10 Tue 11:02]
- State "DONE"       from "DOING"      [2021-08-09 Mon 10:28]
- State "DONE"       from "DOING"      [2021-08-08 Sun 23:37]
- State "DONE"       from "DOING"      [2021-08-07 Sat 11:10]
- State "DONE"       from "DOING"      [2021-08-06 Fri 12:26]
- State "DONE"       from "TODO"       [2021-08-05 Thu 16:51]
- State "DONE"       from "DOING"      [2021-08-04 Wed 11:13]
- State "DONE"       from "TODO"       [2021-08-03 Tue 12:36]
:LOGBOOK:
CLOCK: [2021-08-11 Wed 10:37]--[2021-08-11 Wed 10:46] =>  0:09
CLOCK: [2021-08-09 Mon 10:21]--[2021-08-09 Mon 10:28] =>  0:07
CLOCK: [2021-08-08 Sun 22:46]--[2021-08-08 Sun 23:11] =>  0:25
CLOCK: [2021-08-07 Sat 10:56]--[2021-08-07 Sat 11:10] =>  0:14
CLOCK: [2021-08-07 Sat 10:09]--[2021-08-07 Sat 10:34] =>  0:25
CLOCK: [2021-08-06 Fri 12:08]--[2021-08-06 Fri 12:26] =>  0:18
CLOCK: [2021-08-04 Wed 11:09]--[2021-08-04 Wed 11:13] =>  0:04
CLOCK: [2021-08-03 Tue 10:14]--[2021-08-03 Tue 10:15] =>  0:01
:END:
[2021-08-03 Tue 10:14]
* TODO [[id:cb6871f7-e947-4c60-a04e-244ccaf8b59b][Java Interview Questions]] :learning:
SCHEDULED: <2021-08-12 Thu 12:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2021-08-11 Wed 11:13]
:END:
- State "DONE"       from "STRT"       [2021-08-11 Wed 11:13]
- State "DONE"       from "TODO"       [2021-08-10 Tue 11:02]
- State "DONE"       from "DOING"      [2021-08-09 Mon 10:43]
- State "CANCEL"     from "TODO"       [2021-08-09 Mon 10:29]
- State "DONE"       from "DOING"      [2021-08-07 Sat 11:39]
- State "DONE"       from "DOING"      [2021-08-06 Fri 13:01]
- State "CANCEL"     from "TODO"       [2021-08-06 Fri 12:27]
- State "DONE"       from "DOING"      [2021-08-04 Wed 12:10]
- State "DONE"       from "DOING"      [2021-08-03 Tue 11:07]
:LOGBOOK:
CLOCK: [2021-08-09 Mon 10:29]--[2021-08-09 Mon 10:43] =>  0:14
CLOCK: [2021-08-07 Sat 11:16]--[2021-08-07 Sat 11:39] =>  0:23
CLOCK: [2021-08-07 Sat 11:11]--[2021-08-11 Wed 11:12] => 96:01
CLOCK: [2021-08-06 Fri 12:58]--[2021-08-06 Fri 13:01] =>  0:03
CLOCK: [2021-08-06 Fri 12:27]--[2021-08-06 Fri 12:52] =>  0:25
CLOCK: [2021-08-04 Wed 11:47]--[2021-08-04 Wed 12:10] =>  0:23
CLOCK: [2021-08-04 Wed 11:14]
CLOCK: [2021-08-03 Tue 10:56]--[2021-08-03 Tue 11:07] =>  0:11
CLOCK: [2021-08-03 Tue 10:17]
:END:
[2021-08-03 Tue 10:17]
* DONE Change all leetcode notes into org-mode                         :normal:
CLOSED: [2021-08-03 Tue 12:35] SCHEDULED: <2021-08-03 Tue>
:LOGBOOK:
CLOCK: [2021-08-03 Tue 11:59]--[2021-08-03 Tue 12:24] =>  0:25
CLOCK: [2021-08-03 Tue 11:25]--[2021-08-03 Tue 11:25] =>  0:00
CLOCK: [2021-08-03 Tue 11:24]--[2021-08-03 Tue 11:24] =>  0:00
CLOCK: [2021-08-03 Tue 11:23]--[2021-08-03 Tue 11:23] =>  0:00
:END:
[2021-08-03 Tue 11:22]
[[file:~/org/RoamNotes/20210803025017-leetcode.org::+title: Leetcode]]
* DONE Add record number to personal website: fastdata.top
CLOSED: [2021-08-05 Thu 16:50] SCHEDULED: <2021-08-04 Wed 14:30>
:LOGBOOK:
CLOCK: [2021-08-04 Wed 12:18]--[2021-08-04 Wed 12:19] =>  0:01
:END:
[2021-08-04 Wed 12:18]
* TODO Reading Hadoop definition guide
SCHEDULED: <2021-08-12 Thu 12:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2021-08-11 Wed 11:40]
:END:
- State "DONE"       from "STRT"       [2021-08-11 Wed 11:40]
- State "DONE"       from "TODO"       [2021-08-10 Tue 18:41]
- State "DONE"       from "DOING"      [2021-08-09 Mon 11:07]
- State "CANCEL"     from "TODO"       [2021-08-09 Mon 10:44]
- State "DONE"       from "DOING"      [2021-08-07 Sat 12:01]
- State "DONE"       from "DOING"      [2021-08-06 Fri 13:25]
- State "CANCEL"     from "TODO"       [2021-08-06 Fri 13:02]
- State "DONE"       from "DOING"      [2021-08-04 Wed 14:02]
:LOGBOOK:
CLOCK: [2021-08-11 Wed 11:14]--[2021-08-11 Wed 11:39] =>  0:25
CLOCK: [2021-08-07 Sat 11:40]--[2021-08-07 Sat 12:01] =>  0:21
CLOCK: [2021-08-06 Fri 13:02]--[2021-08-06 Fri 13:25] =>  0:23
CLOCK: [2021-08-04 Wed 13:00]--[2021-08-04 Wed 13:25] =>  0:25
CLOCK: [2021-08-04 Wed 12:30]--[2021-08-04 Wed 12:55] =>  0:25
CLOCK: [2021-08-04 Wed 12:29]--[2021-08-04 Wed 12:29] =>  0:00
:END:
[2021-08-04 Wed 12:28]
*
* TODO change this style into functional style (by using reduceLeft or recudeRight or any functions else)
SCHEDULED: <2021-08-09 Mon 22:00>
:LOGBOOK:
CLOCK: [2021-08-09 Mon 18:56]--[2021-08-09 Mon 18:57] =>  0:01
:END:
[2021-08-09 Mon 18:56]
[[file:~/Documents/code/Work/java-data-handlers/src/main/scala/com/labelhub/datahandlers/nuport/ExportTxt.scala::dataArr.forEach(dataItem => {]]
* Inbox
** TODO Read a technique article and write some notes :learning:
SCHEDULED: <2021-08-12 Thu 14:20 +1d>
:PROPERTIES:
:LAST_REPEAT: [2021-08-11 Wed 15:01]
:END:
- State "DONE"       from "STRT"       [2021-08-11 Wed 15:01]
:LOGBOOK:
CLOCK: [2021-08-11 Wed 14:26]--[2021-08-11 Wed 14:51] =>  0:25
:END:

** STRT write local csv data into HDFS :work:greyparrot:
SCHEDULED: <2021-08-11 Wed 13:00>
:LOGBOOK:
CLOCK: [2021-08-11 Wed 16:28]--[2021-08-11 Wed 16:53] =>  0:25
CLOCK: [2021-08-11 Wed 15:57]--[2021-08-11 Wed 16:22] =>  0:25
CLOCK: [2021-08-11 Wed 15:27]--[2021-08-11 Wed 15:52] =>  0:25
CLOCK: [2021-08-11 Wed 15:01]--[2021-08-11 Wed 15:26] =>  0:25
CLOCK: [2021-08-11 Wed 13:30]--[2021-08-11 Wed 13:55] =>  0:25
CLOCK: [2021-08-11 Wed 12:59]--[2021-08-11 Wed 13:24] =>  0:25
:END:

** DONE learning how to read papers by using zotero :learning:
SCHEDULED: <2021-08-11 Wed 12:00>
:LOGBOOK:
CLOCK: [2021-08-11 Wed 12:05]--[2021-08-11 Wed 12:30] =>  0:25
:END:

** DONE export nuport origin images :work:nuport:
SCHEDULED: <2021-08-11 Wed 13:00>
:LOGBOOK:
CLOCK: [2021-08-11 Wed 10:09]--[2021-08-11 Wed 10:34] =>  0:25
:END:


** [X] know about DOOM emacs
SCHEDULED: <2021-08-10 Tue 22:00>
